//
//  everyday.h
//  LU
//
//  Created by peng jin on 2019/6/17.
//  Copyright © 2019 JinPeng. All rights reserved.
//

#ifndef everyday_h
#define everyday_h
/* 工作计划相关
 1、点买页，我的策略、已完成策略，补亏，修改策略，
 明细页，充值页、提现，
 搜索对接、收藏、浏览记录对接、
 2、相关web页对接，推荐及推荐注册、推荐明细对接、
 首页对接：轮播图、通知、跟买列表
 3、注册登录相关对接
 注册、修改密码、昵称、实名认证、绑定银行卡、上传头像、修改提现密码
 4、意见对接
 
 6-17、对接首页轮播图显示、注册相关、实名认证、绑定银行卡、
 1、首页轮播图未添加跳转
 2、注册成功后未获取用户信息，并刷新个人中心 //合并至5
 3、登录成功后未获取用户信息，并刷新个人中心 //合并至5
 4、消息列表（是否做）
 5、登录成功后，获取用户信息和刷新个人中心由于接口未实现，未做
 6、推出登录清除信息
 
 6-18、对接搜索显示相关、买入、卖出、页面、我的策略（补亏）、修改策略
 6-19、对接已完成策略、充值、提现、明细列表
 6-20、推荐页相关内容、反馈、上传头像，修改昵称等
 6-21、查漏补缺,通用跳转功能实现
 
 需确认问题：1、首页跟买显示规则
           2、充值方式
            3、补亏上下限范围
            4、推荐规则
            5、修改策略通知方式（无限修改？通知怎么办）
 
 未完成：
 7、首页消息获取和调整、轮播图跳转、第三主页新闻获取和跳转 。action 及列表接口对接
 8、说明页和协议内容等帮助、意见反馈等。 getconf接口对接 ，还差一个风险提示，和策略合作协议
 9、获取充值信息，充值页 充值接口对接 ok
 10、交易详情的详情页对接 ，还差一个递延费
 
 11、消息页对接
 
 12、获取用户ip地址。wifi获取的是内网地址
 
 
 
 */

#endif /* everyday_h */
